# Contains Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
CableTraySizes..::..Contains Method
CableTraySizes Class See Also
---
Checks whether a cable tray size with the nominal diameter exists.
**Namespace:** Autodesk.Revit.DB.Electrical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2017
# Syntax
C#
---
```text
public bool Contains(
	double nominalDiameter
)
```

Visual Basic
---
```text
Public Function Contains ( _
	nominalDiameter As Double _
) As Boolean
```

Visual C++
---
```text
public:
bool Contains(
	double nominalDiameter
)
```

# ### Parameters
nominalDiameter
    Type: System..::..Double Nominal diameter.
# ### Return Value
True if a cable tray size with the nominal diameter exists.
# See Also
CableTraySizes Class
Autodesk.Revit.DB.Electrical Namespace